OMD_EXCH/InformationRegisters/ОДМ_ЗадачиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОДМ_ЗадачиОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОДМ_СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попытка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментСтарта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментФиниша</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОДМ_БазыДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПараметры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерРезультат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖурналСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

OMD_EXCH/Catalogs/ОДМ_БазыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОДМ_БазыДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>TODO: подвязаться к RAS</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Comment>TODO: временный реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>TODO: временный реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонфигурации</Name>
					<Comment>TODO: в справочник?</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Comment>TODO: временный реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТехническиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПодключения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сервер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяБазы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Разрешения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сервис</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Метаданные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КешироватьЗначения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрироватьВУзлеОбмена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыгружатьПриЗаписи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

OMD_EXCH/HTTPServices/ОДМ_xchg/Ext/Module.bsl
#Область ОбработчикиСобытий

Функция jobGET(Запрос)
	
	ТелоЗапросаHTTP = Запрос.ПолучитьТелоКакСтроку();
	СтруктураОтбора = ОДМ_ОбменДанными.ДесериализоватьJSON(ТелоЗапросаHTTP);
	
	Если НЕ ЗначениеЗаполнено(СтруктураОтбора) Тогда
		ТекстСообщения = НСтр("ru='Не заполнены параметры получения задач';
								|en='The task receipt parameters are not filled in'");
		Возврат HTTPОтветJSON(ТекстСообщения, 400);
	КонецЕсли;
	
	ОписаниеЗадачи = ОДМ_ОбменДанными.СостояниеЗадач(СтруктураОтбора);
	Возврат HTTPОтветJSON(ОписаниеЗадачи);
	
КонецФункции

Функция Query(Запрос)
	
	ИмяМетода = "query";
	
	РезультатМетода = Новый Структура("ВозвращаемыеДанные, КодСостояния", Новый Структура, 200);
	
	//FIXME: плохой кусок
	Идентификатор = Неопределено;
	АсинхронныйВызов = ЭтоАсинхронныйВызов(Запрос, Идентификатор);
	//<-
	
	ОписаниеЗадачи = ОДМ_ОбменДанными.Конструктор_ОписаниеЗадачи(Идентификатор);
	ОписаниеЗадачи.Метод			= ИмяМетода;
	ОписаниеЗадачи.АсинхронныйВызов	= АсинхронныйВызов;
	ОписаниеЗадачи.Статус			= Перечисления.ОДМ_СтатусыЗадач.Подготовлен;
	
	//FIXME: плохой кусок + объединить в ЭтоАсинхронныйВызов() ?
	ХарактеристикиДоступа(Запрос, ОписаниеЗадачи);
	//<-
	
	ТелоЗапросаHTTP = Запрос.ПолучитьТелоКакСтроку();
	ОписаниеЗадачи.Параметры = ОДМ_ОбменДанными.ДесериализоватьJSON(ТелоЗапросаHTTP);
	
	РезультатМетода = ОбработатьВходящуюЗадачу(ОписаниеЗадачи);
	
	Возврат HTTPОтветJSON(РезультатМетода.ВозвращаемыеДанные, РезультатМетода.КодСостояния);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция listGET(Запрос)
	
	ИмяМетода = "list";
	
	РезультатМетода = Новый Структура("ВозвращаемыеДанные, КодСостояния", "", 200);
	
	Попытка
		ИмяМетаданных = Запрос.ПараметрыURL["metaname"];
		Если ПустаяСтрока(ИмяМетаданных) Тогда
			ВызватьИсключение "не заполнено имя запрашиваемых данных";
		КонецЕсли;
		
		РезультатМетода.ВозвращаемыеДанные = СписокПодходящихЭлементов(ИмяМетаданных, Запрос.ПараметрыЗапроса);
		
	Исключение
		РезультатМетода.ВозвращаемыеДанные = ОписаниеОшибки();
		РезультатМетода.КодСостояния = 400;
	КонецПопытки;
	
	Возврат HTTPОтветJSON(РезультатМетода.ВозвращаемыеДанные, РезультатМетода.КодСостояния);
	
КонецФункции

Функция objectGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция objectPOST(Запрос)
	
	//TODO: подумать как реализовать проверку,
	//что бы из по дефолту от тестовых баз, например, к боевой отказ шел
	РазрешеноПолучатьДанные = Истина;
	Если РазрешеноПолучатьДанные = Ложь Тогда
		ТекстСообщения = НСтр("ru='Клиент не имеет прав доступа к контенту';
								|en='The client does not have access rights to the content'");
		Возврат HTTPОтветJSON(ТекстСообщения, 403);
	КонецЕсли;
	
	РезультатМетода = Новый Структура("ВозвращаемыеДанные, КодСостояния", Новый Структура, 200);
	
	ТелоЗапросаHTTP = Запрос.ПолучитьТелоКакСтроку();
	ОписаниеЗапроса = ОДМ_ОбменДанными.ДесериализоватьJSON(ТелоЗапросаHTTP);
	
	//FIXME: плохой кусок
	Идентификатор = Неопределено;
	АсинхронныйВызов = ЭтоАсинхронныйВызов(Запрос, Идентификатор);
	//<-
	
	ОписаниеЗадачи = ОДМ_ОбменДанными.Конструктор_ОписаниеЗадачи(Идентификатор);
	ОписаниеЗадачи.Метод			= "objectPOST";
	ОписаниеЗадачи.АсинхронныйВызов	= АсинхронныйВызов;
	ОписаниеЗадачи.Статус			= Перечисления.ОДМ_СтатусыЗадач.Подготовлен;
	ОписаниеЗадачи.Параметры		= ОписаниеЗапроса;
	
	РезультатМетода = ОбработатьВходящуюЗадачу(ОписаниеЗадачи);
	
	Возврат HTTPОтветJSON(РезультатМетода.ВозвращаемыеДанные, РезультатМетода.КодСостояния);
	
КонецФункции

Функция Code(Запрос)
	
	//TODO: подумать как реализовать проверку,
	//что бы из по дефолту от тестовых баз, например, к боевой отказ шел
	РазрешеноПолучатьДанные = Истина;
	Если РазрешеноПолучатьДанные = Ложь Тогда
		ТекстСообщения = НСтр("ru='Клиент не имеет прав доступа к контенту';
								|en='The client does not have access rights to the content'");
		Возврат HTTPОтветJSON(ТекстСообщения, 403);
	КонецЕсли;
	
	Попытка
		Тело = Запрос.ПолучитьТелоКакСтроку();
		лСтруктураПараметры = ДесериализоватьJSON(Тело);
		Если ТипЗнч(лСтруктураПараметры) <> Тип("Структура") Тогда 
			Возврат HTTPОтветJSON("В теле запроса должна быть передана структура с полями: Текст или Имя, Параметры", 400);
		КонецЕсли;
		
		лТекстОшибки = Неопределено;
		лТекст = мПолучитьТекст(лСтруктураПараметры, Ложь, лТекстОшибки);
		Если лТекст = Неопределено Тогда Возврат HTTPОтветJSON(лТекстОшибки, 400); КонецЕсли; 
		
		Параметры = лСтруктураПараметры.Параметры;
		лТекст = СтрЗаменить(лТекст,"$","""");
		ЗначениеВозврата = Неопределено;
		
		//ОбщегоНазначения.ВыполнитьВБезопасномРежиме(лТекст,Параметры);//Не возвращает ГУИД ссылки справочника
		
		Выполнить(лТекст);
		
		Возврат HTTPОтветJSON(ЗначениеВозврата);
		
	Исключение 
		лИнформацияОбОшибке = ИнформацияОбОшибке();
		Возврат HTTPОтветJSON(ПолучитьПолноеОписаниеОшибки(лИнформацияОбОшибке), 400);
	КонецПопытки;

КонецФункции

Функция ping(Запрос)
	
	Возврат HTTPОтветJSON("OK");
	
КонецФункции

Функция infoGET(Запрос)
	
	Возврат HTTPОтветJSON(ОДМ_ОбменДанными_ПовтИсп.ПолучитьПараметрыСервера());
	
КонецФункции

#КонецОбласти

//TODO: подумать надо ли работу с методами вынести в модуль ОДМ_ОбщегоНазначения или вообще в отдельный модуль - для общего использования

#Область СлужебныеПроцедурыИФункции

Функция СписокПодходящихЭлементов(Знач ИмяМетаданных, Знач ПараметрыЗапроса)
	
	РезультатМетода = Новый Структура("quantity, list", 0, Новый Массив);
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	т.ВерсияДанных КАК ВерсияДанных
	               |ИЗ
	               |	Справочник.ОДМ_БазыДанных КАК т
	               |ГДЕ
	               |	ИСТИНА
	               |	И НЕ т.ПометкаУдаления";
	
	// # TODO: завернуть в параметр filters (пометка, группа, дата, ...)
	Если СтрНачинаетсяС(ИмяМетаданных, "Справочник.") Тогда
		ТекстЗапроса = ТекстЗапроса + " И НЕ т.ЭтоГруппа";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.ОДМ_БазыДанных", ИмяМетаданных);
	
	СтрокаПоиска = ПараметрыЗапроса.Получить("search");
	Если НЕ ПустаяСтрока(СтрокаПоиска) Тогда
		МассивУсловий = Новый Массив;
		МассивСтрок = СтрРазделить(СтрокаПоиска, " ", Ложь); //#TODO: свернуть? разные раделитель?
		
		Для Индекс = 0 По МассивСтрок.ВГраница() Цикл
			ИмяПараметра = СтрШаблон("ПараметрПодобногоПоиска%1", Формат(Индекс, "ЧГ=''"));
			МассивУсловий.Добавить( СтрШаблон("т.Наименование подобно &%1", ИмяПараметра) );
			Запрос.Параметры.Вставить(ИмяПараметра, "%" + МассивСтрок[Индекс] + "%" );
		КонецЦикла;
		
		ТекстЗапроса = СтрШаблон(	"%1
									|И (%2)",
									ТекстЗапроса,
									СтрСоединить(МассивУсловий, " И ")
		);
	КонецЕсли;
	
	ТекстЗапроса1 = СтрЗаменить(ТекстЗапроса,	"т.ВерсияДанных КАК ВерсияДанных", "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ т.Ссылка) КАК Количество");
	
	ВыбираемыеПоля = Новый Соответствие;
	ВыбираемыеПоля.Вставить("guid", "УНИКАЛЬНЫЙИДЕНТИФИКАТОР(т.Ссылка)");
	ВыбираемыеПоля.Вставить("name", "т.Наименование");
	
	ЗапрашиваемыеПоля = ПараметрыЗапроса.Получить("fields");
	Если НЕ ПустаяСтрока(СтрокаПоиска) Тогда
		МассивСтрок = СтрРазделить(ЗапрашиваемыеПоля, ",", Ложь);
		
		Для Каждого Элемент Из МассивСтрок Цикл
			//fields=Код:code,Артикул
			БлокПоля = СтрРазделить(Элемент, ":");
			Если БлокПоля.Количество()=1 Тогда
				БлокПоля.Добавить( БлокПоля[0] );
			КонецЕсли;
			ВыбираемыеПоля.Вставить(БлокПоля[1], СтрШаблон("т.%1", БлокПоля[0]));
		КонецЦикла;
		
	КонецЕсли;
	
	СвойстваЭлемента = Новый Массив;
	МассивПолей = Новый Массив;
	Для Каждого Элемент Из ВыбираемыеПоля Цикл
		МассивПолей.Добавить( СтрШаблон("%1 как %2", Элемент.Значение, Элемент.Ключ) );
		СвойстваЭлемента.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	БлокИменПолей = СтрСоединить(МассивПолей, ", ");
	СвойстваЭлемента = СтрСоединить(СвойстваЭлемента, ", ");
	
	ТекстЗапроса2 = СтрЗаменить(ТекстЗапроса,	"т.ВерсияДанных КАК ВерсияДанных", БлокИменПолей);
	
	РазмерПорции = ПараметрыЗапроса.Получить("portion_size");
	РазмерПорции = ОбщегоНазначения.ОписаниеТипаЧисло(5).ПривестиЗначение(РазмерПорции);
	РазмерПорции = Формат(РазмерПорции, "ЧДЦ=0; ЧН=50; ЧГ=");
	
	ТекстЗапроса2 = СтрЗаменить(ТекстЗапроса2,	"ВЫБРАТЬ РАЗРЕШЕННЫЕ", СтрШаблон("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %1", РазмерПорции));
	
	Запрос.Текст = СтрШаблон(	"%1;
								|
								|%2", ТекстЗапроса1, ТекстЗапроса2);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		РезультатМетода["quantity"] = Выборка.Количество;
	КонецЕсли;
	
	Если РезультатМетода["quantity"] > 0 Тогда
		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			ОписаниеЭлемента = Новый Структура(СвойстваЭлемента);
			ЗаполнитьЗначенияСвойств(ОписаниеЭлемента, Выборка);
			ОписаниеЭлемента["guid"] = Строка(ОписаниеЭлемента["guid"]);
			РезультатМетода["list"].Добавить(ОписаниеЭлемента);
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

Функция ОбработатьВходящуюЗадачу(ОписаниеЗадачи)
	
	РезультатМетода = Новый Структура("ВозвращаемыеДанные, КодСостояния", Новый Структура, 200);
	
	Если ОписаниеЗадачи.АсинхронныйВызов Тогда
		РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(ОписаниеЗадачи);
		РезультатМетода.ВозвращаемыеДанные.Вставить("Идентификатор", ОписаниеЗадачи.Идентификатор);
		
	ИначеЕсли Перечисления.ОДМ_СтатусыЗадач.ЭтоЗавершенныйСтатус(ОписаниеЗадачи.Статус) Тогда
		РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(ОписаниеЗадачи);
		РезультатМетода.ВозвращаемыеДанные = ОписаниеЗадачи.Результат;
		
		Если ОписаниеЗадачи.Результат = "Ошибка доступа" Тогда // FIXME: ужос как плохо
			РезультатМетода.КодСостояния = 403;
		КонецЕсли;
		
	Иначе
		
		Попытка
			
			//FIXME: плохой роутер - связать переделку c ОДМ_РегламентныеЗадания.ОДМ_ОбработкаЗадач()
			Если ОписаниеЗадачи.Метод = "query" Тогда
				ОДМ_ОбменДанными.ВыполнитьЗапрос(ОписаниеЗадачи);
				
			ИначеЕсли ОписаниеЗадачи.Метод = "objectPOST" Тогда
				ОДМ_ОбменДанными.ЗаписатьОбъект(ОписаниеЗадачи);
				
			Иначе
				ТекстСообщения = НСтр("ru='Что-то пошло не так :( Неизвестный метод %1';
										|en='Something went wrong :( Unknown method %1'");
				ВызватьИсключение СтрШаблон(ТекстСообщения, ОписаниеЗадачи.Метод);
			КонецЕсли;
			//<-
			
			РезультатМетода.ВозвращаемыеДанные = ОписаниеЗадачи.Результат;
		Исключение
			РезультатМетода.ВозвращаемыеДанные = ПолучитьПолноеОписаниеОшибки(ИнформацияОбОшибке());
			РезультатМетода.КодСостояния = 400;
		КонецПопытки;
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

Функция ХарактеристикиДоступа(Знач Запрос, ОписаниеЗадачи)
	
	РезультатМетода = Ложь;
	
	//TODO: причесать спрятать в менеджер справочника
	
	Попытка
		ЗначениеПараметра = Запрос.ПараметрыЗапроса["initiator"];
		ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра, "/", "\"); //FIXME: кастыль :( нет времени разбераться почему при передаче угол черты меняется :(
		ОписаниеИнициатора = ОДМ_ОбщегоНазначения.JSONВЗначение(ЗначениеПараметра);
	Исключение
		ОписаниеЗадачи.Статус = Перечисления.ОДМ_СтатусыЗадач.Отменен;
		ОписаниеЗадачи.Результат = "Ошибка доступа";
		Возврат РезультатМетода;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Ссылка КАК Ссылка,
	                      |	тт.Доступность КАК Доступность
	                      |ИЗ
	                      |	Справочник.ОДМ_БазыДанных.ТехническиеПараметры КАК т
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОДМ_БазыДанных.Разрешения КАК тт
	                      |		ПО т.Ссылка = тт.Ссылка
	                      |ГДЕ
	                      |	т.СтрокаПодключения = &СтрокаПодключения
	                      |	И тт.Сервис = &Сервис");
	Запрос.УстановитьПараметр("СтрокаПодключения",		ОписаниеИнициатора["connectionPath"]);
	Запрос.УстановитьПараметр("Сервис",					ОписаниеЗадачи.Метод);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		ОписаниеЗадачи.Статус = Перечисления.ОДМ_СтатусыЗадач.Отменен;
		ОписаниеЗадачи.Результат = "Для источника обнаружена неопределенность данных. Свяжитесь со службой поддержки!";
		Возврат РезультатМетода;
	Иначе
		Если Выборка.Следующий() Тогда
			
			Если Выборка.Доступность = NULL Тогда
				БазаДанныхОбъект = Выборка.Ссылка.ПолучитьОбъект();

				НоваяСтрока = БазаДанныхОбъект.Разрешения.Добавить();
				НоваяСтрока.Сервис = ОписаниеЗадачи.ИмяМетода;
				
				БазаДанныхОбъект.Записать();
				ОписаниеЗадачи.Инициатор = БазаДанныхОбъект.Ссылка;
			Иначе
				РезультатМетода = Выборка.Доступность;
				ОписаниеЗадачи.Инициатор = Выборка.Ссылка;
			КонецЕсли;
			
		Иначе
			БазаДанныхОбъект = Справочники.ОДМ_БазыДанных.СоздатьЭлемент();
			БазаДанныхОбъект.УстановитьНовыйКод();
		
			НоваяСтрока = БазаДанныхОбъект.ТехническиеПараметры.Добавить();
			НоваяСтрока.СтрокаПодключения = ОписаниеИнициатора["connectionPath"];
			
			НоваяСтрока = БазаДанныхОбъект.Разрешения.Добавить();
			НоваяСтрока.Сервис = ОписаниеЗадачи.Метод;
			
			БазаДанныхОбъект.Записать();
			ОписаниеЗадачи.Инициатор = БазаДанныхОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ РезультатМетода = Истина Тогда
		ОписаниеЗадачи.Статус = Перечисления.ОДМ_СтатусыЗадач.Отменен;
		ОписаниеЗадачи.Результат = "Ошибка доступа";
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

Функция ЭтоАсинхронныйВызов(Знач Запрос, Идентификатор)
	
	РезультатМетода = Истина;
	Попытка
		Идентификатор = Запрос.ПараметрыЗапроса["async"];
	Исключение
		РезультатМетода = Ложь;
	КонецПопытки;
	
	Возврат РезультатМетода;
	
КонецФункции

// Функция: СериализоватьXML
// Назначение: Сериализует объект в формат XML.
// Входные параметры:
//   ОбъектСериализации - Произвольный - Объект для сериализации.
// Возвращаемое значение:
//   Строка - XML-строка, представляющая объект.
Функция СериализоватьXML(ОбъектСериализации)
	
	ОбъектВXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(Запись, ОбъектВXDTO);
	Возврат Запись.Закрыть();
	
КонецФункции

// Функция: ДесериализоватьXML
// Назначение: Десериализует XML-строку в объект.
// Входные параметры:
//   XMLСтруктура - Строка - XML-строка для десериализации.
// Возвращаемое значение:
//   Произвольный - Десериализованный объект.
Функция ДесериализоватьXML(XMLСтруктура) 
	
	ЧтениеXMLДанных = Новый ЧтениеXML; 
	ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктура); 
	Параметр = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных); 
	ЧтениеXMLДанных.Закрыть(); 
	
	Возврат Параметр;
	
КонецФункции

// Устарела. Следует использовать ОДМ_ОбменДанными.СериализоватьJSON
// Функция: СериализоватьJSON
// Назначение: Сериализует объект в формат JSON.
// Входные параметры:
//   пЗначение - Произвольный - Объект для сериализации.
// Возвращаемое значение:
//   Строка - JSON-строка, представляющая объект.
Функция СериализоватьJSON(пЗначение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	Попытка	
		ЗаписатьJSON(ЗаписьJSON, пЗначение);
	Исключение 
		лПутьОшибки = Неопределено;
		лЗначениеОшибочное = мВыгрузкаВJSONНайтиПутьОшибочногоЗначения(пЗначение, лПутьОшибки);
		лТекстОшибки = "Не смогли выгрузить значение: "+?(лЗначениеОшибочное=Null, "Null", лЗначениеОшибочное)+", по пути: "+лПутьОшибки;
		Сообщить(лТекстОшибки); 
		ВызватьИсключение лТекстОшибки;
	КонецПопытки;
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Устарела. Следует использовать ОДМ_ОбменДанными.ДесериализоватьJSON
// Функция: ДесериализоватьJSON
// Назначение: Десериализует JSON-строку в объект.
// Входные параметры:
//   пЗначение - Строка - JSON-строка для десериализации.
//   пПрочитатьВСоответствие - Булево - Флаг, указывающий, нужно ли преобразовывать JSON в соответствие.
// Возвращаемое значение:
//   Произвольный - Десериализованный объект.
Функция ДесериализоватьJSON(пЗначение, пПрочитатьВСоответствие=Ложь)
	
	ЧтениеJSONДанных = Новый ЧтениеJSON;
	ЧтениеJSONДанных.УстановитьСтроку(пЗначение);
	Структура=ПрочитатьJSON(ЧтениеJSONДанных, пПрочитатьВСоответствие);
	ЧтениеJSONДанных.Закрыть();
	
	Возврат Структура;
	
КонецФункции

// Функция: HTTPОтветJSON
// Назначение: Формирует HTTP-ответ в формате JSON.
// Входные параметры:
//   пДанные - Произвольный - Данные для возврата в ответе.
//   пКод - Число - HTTP-код ответа (по умолчанию 200).
// Возвращаемое значение:
//   HTTPСервисОтвет - Ответ в формате JSON.
Функция HTTPОтветJSON(Знач Данные, Знач Код = 200)
	
	ХТТПСервисОтвет = Новый HTTPСервисОтвет(Код);
	ХТТПСервисОтвет.Заголовки.Вставить("Content-Type", "application/json");
	
	СериализованныеДанные = ОДМ_ОбменДанными.СериализоватьJSON(Данные);
	
	ХТТПСервисОтвет.УстановитьТелоИзСтроки(СериализованныеДанные);
	
	Возврат ХТТПСервисОтвет;
	
КонецФункции

// Функция: мПолучитьТекст
// Назначение: Получает текст запроса или алгоритма из структуры параметров.
// Входные параметры:
//   пСтруктураПараметры - Структура - Структура с параметрами запроса.
//   пЭтоЗапрос - Булево - Флаг, указывающий, является ли запрос текстовым.
//   пТекстОшибки - Строка - Переменная для возврата текста ошибки.
// Возвращаемое значение:
//   Строка - Текст запроса или алгоритма.
Функция мПолучитьТекст(пСтруктураПараметры, пЭтоЗапрос, пТекстОшибки)
	лИмя = Неопределено;
	Если пСтруктураПараметры.Свойство("Имя", лИмя) Тогда

	КонецЕсли;
	лТекст = Неопределено;
	Если Не пСтруктураПараметры.Свойство("ТекстЗапроса", лТекст) Тогда
		пТекстОшибки = "Не задано ни имя алгоритма ни его текст";
		Возврат Неопределено;
	КонецЕсли;
	Возврат лТекст;
КонецФункции

// Устарела. Следует использовать ОДМ_ОбменДанными.ПолноеОписаниеОшибки
// Функция: ПолучитьПолноеОписаниеОшибки
// Назначение: Возвращает полное описание ошибки, включая вложенные причины.
// Входные параметры:
//   пИнформацияОбОшибке - ИнформацияОбОшибке - Объект с информацией об ошибке.
// Возвращаемое значение:
//   Строка - Полное описание ошибки.
Функция ПолучитьПолноеОписаниеОшибки(пИнформацияОбОшибке) Экспорт
	лОписание = пИнформацияОбОшибке.Описание;
	Если ЗначениеЗаполнено(пИнформацияОбОшибке.НомерСтроки) Тогда лОписание=лОписание+" {"+пИнформацияОбОшибке.ИмяМодуля+": "+пИнформацияОбОшибке.НомерСтроки+"}"; КонецЕсли;
	Если пИнформацияОбОшибке.Причина<>Неопределено Тогда лОписание=лОписание+Символы.ПС+ПолучитьПолноеОписаниеОшибки(пИнформацияОбОшибке.Причина); КонецЕсли;
	Возврат лОписание;
КонецФункции

// Функция: мВыгрузкаВJSONНайтиПутьОшибочногоЗначения
// Назначение: Рекурсивно ищет значение, которое не может быть сериализовано в JSON.
// Входные параметры:
//   пЗначение - Произвольный - Объект для проверки.
//   пПутьОшибки - Строка - Переменная для возврата пути к ошибочному значению.
// Возвращаемое значение:
//   Произвольный - Ошибочное значение или Неопределено, если ошибок нет.
Функция мВыгрузкаВJSONНайтиПутьОшибочногоЗначения(пЗначение, пПутьОшибки)
	лТип = ТипЗнч(пЗначение);
	Если лТип = Тип("Соответствие") или лТип=Тип("Структура") Тогда 
		Для Каждого лКлючИЗначение Из пЗначение Цикл
			Если лТип = Тип("Соответствие") Тогда 
				лПутьОшибки = Неопределено;
				лЗначениеОшибки = мВыгрузкаВJSONНайтиПутьОшибочногоЗначения(лКлючИЗначение.Ключ, лПутьОшибки);
				Если лЗначениеОшибки<>Неопределено Тогда 
					пПутьОшибки=лКлючИЗначение.Ключ+" (ключ)"+"."+лПутьОшибки;
					Возврат лЗначениеОшибки; 
				КонецЕсли;
			КонецЕсли;
			лПутьОшибки = Неопределено;
			лЗначениеОшибки = мВыгрузкаВJSONНайтиПутьОшибочногоЗначения(лКлючИЗначение.Значение, лПутьОшибки);
			Если лЗначениеОшибки <> Неопределено Тогда 
				пПутьОшибки=лКлючИЗначение.Ключ+?(лПутьОшибки<>Неопределено, ?(Лев(лПутьОшибки, 1)<>"[", ".", "")+лПутьОшибки, "");
				Возврат лЗначениеОшибки;
			КонецЕсли;
		КонецЦикла;
		Возврат Неопределено;
		
	ИначеЕсли лТип = Тип("Массив") Тогда
		лНомерСтроки = 0;
		Для Каждого лЗначение Из пЗначение Цикл
			лНомерСтроки = лНомерСтроки+1;
			лПутьОшибки = Неопределено;
			лЗначениеОшибки = мВыгрузкаВJSONНайтиПутьОшибочногоЗначения(лЗначение, лПутьОшибки);
			Если лЗначениеОшибки <> Неопределено Тогда 
				пПутьОшибки = "["+Формат(лНомерСтроки, "ЧГ=")+"]"+?(лПутьОшибки<>Неопределено, ?(Лев(лПутьОшибки, 1)<>"[", ".", "")+лПутьОшибки, "");
				Возврат лЗначениеОшибки;
			КонецЕсли;
		КонецЦикла;
		Возврат Неопределено;
	КонецЕсли;
	
	лЗаписьJSON = Новый ЗаписьJSON;
	лЗаписьJSON.УстановитьСтроку();
	Попытка	
		ЗаписатьJSON(лЗаписьJSON, пЗначение);
	Исключение 
		Возврат пЗначение;
	КонецПопытки;
	Возврат Неопределено;
КонецФункции

// Функция: ВМассивСтруктур
// Назначение: Преобразование таблицы значений или дерева значений в массив структур
// Входные параметры:
//   пТз (ТаблицаЗначений/ДеревоЗначений) - Таблица или дерево значений, которые необходимо преобразовать
//   пМассивСтруктур (Массив) - Опциональный параметр. Если указан, то результаты добавляются в этот массив
// Возвращаемое значение:
//   Массив - Массив структур, представляющих строки таблицы или ветки дерева
Функция ВМассивСтруктур(пТз, пМассивСтруктур = Неопределено) Экспорт
	лЭтоДерево = ТипЗнч(пТз) = Тип("ДеревоЗначений");
	Возврат мПолучитьМассивСтруктурСтрокПоВеткеДерева(?(лЭтоДерево, пТз.Строки, пТз), лЭтоДерево, пТз.Колонки, пМассивСтруктур); // лСтрокаКолонок, 
КонецФункции

// Функция: мПолучитьМассивСтруктурСтрокПоВеткеДерева
// Назначение: Вспомогательная функция для преобразования строк таблицы или веток дерева в массив структур
// Входные параметры:
//   пСтрокиВеткиДерева (Массив) - Массив строк таблицы или веток дерева
//   пЭтоДерево (Булево) - Флаг, указывающий, что обрабатывается дерево значений
//   пТзКолонки (КоллекцияКолонок) - Колонки таблицы или дерева значений
//   пМассивСтруктур (Массив) - Опциональный параметр. Если указан, то результаты добавляются в этот массив
// Возвращаемое значение:
//   Массив - Массив структур, представляющих строки таблицы или ветки дерева
Функция мПолучитьМассивСтруктурСтрокПоВеткеДерева(пСтрокиВеткиДерева, пЭтоДерево, пТзКолонки, пМассивСтруктур=Неопределено) // пСтрокаСвойств, 
	лМассивСтрок = ?(пМассивСтруктур = Неопределено, Новый Массив, пМассивСтруктур);
	Для Каждого лСтрокаВетки Из пСтрокиВеткиДерева Цикл
		лСтруктура = Новый Структура;// (пСтрокаСвойств);
		Если пЭтоДерево Тогда лСтруктура.Вставить("Строки"); КонецЕсли; 
		
		лИндекс = 0;
		Для Каждого лКолонка Из пТзКолонки Цикл
			лСтруктура.Вставить(лКолонка.Имя, лСтрокаВетки[лИндекс]);
			лИндекс = лИндекс+1;
		КонецЦикла; 
		
		Если пЭтоДерево Тогда лСтруктура.Строки=мПолучитьМассивСтруктурСтрокПоВеткеДерева(лСтрокаВетки.Строки, пЭтоДерево, пТзКолонки); КонецЕсли; // пСтрокаСвойств, 
		лМассивСтрок.Добавить(лСтруктура);
	КонецЦикла;
	Возврат лМассивСтрок;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
